app/controllers/mycon_controller.rb

INSERT INTO `users` (`name`, `updated_at`, `phone`, `email`, `created_at`) VALUES('dgfdgdfg', '2010-12-31 07:35:08', 45546546, 'dfgfdg', '2010-12-31 07:35:08')
---
 def create
	  @user = User.new(params[:user])
	 if  @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 3)
UPDATE `users` SET `email` = 'www.nyros.com', `updated_at` = '2010-12-31 08:46:18', `name` = 'nyrostechnologies' WHERE `id` = 22
---
  def update

  @user = User.find(params[:id])
 @user.update_attributes(params[:user])

SELECT * FROM `users` WHERE (`users`.`id` = 26)
DELETE FROM `users` WHERE (`id` IN (26))
---
  def delete
@user=User.find(params[:id])
@user.delete